[
    {
        "name": "Bulbasaur",
        "id": 1,
        "types": [
            "grass",
            "poison"
        ],
        "stats": {
            "hp": 45,
            "attack": 49,
            "defense": 49,
            "special-attack": 65,
            "special-defense": 65,
            "speed": 45
        },
        "description": "A strange seed was planted on its back at birth. The plant sprouts and grows with this POKéMON.",
        "evolution_info": "bulbasaur evolves into ivysaur via level 16. ivysaur evolves into venusaur via level 32",
        "search_content": "Name: Bulbasaur. Types: grass, poison. Stats: HP 45, Attack 49. Description: A strange seed was planted on its back at birth. The plant sprouts and grows with this POKéMON. Evolution: bulbasaur evolves into ivysaur via level 16. ivysaur evolves into venusaur via level 32"
    },
    {
        "name": "Ivysaur",
        "id": 2,
        "types": [
            "grass",
            "poison"
        ],
        "stats": {
            "hp": 60,
            "attack": 62,
            "defense": 63,
            "special-attack": 80,
            "special-defense": 80,
            "speed": 60
        },
        "description": "When the bulb on its back grows large, it appears to lose the ability to stand on its hind legs.",
        "evolution_info": "bulbasaur evolves into ivysaur via level 16. ivysaur evolves into venusaur via level 32",
        "search_content": "Name: Ivysaur. Types: grass, poison. Stats: HP 60, Attack 62. Description: When the bulb on its back grows large, it appears to lose the ability to stand on its hind legs. Evolution: bulbasaur evolves into ivysaur via level 16. ivysaur evolves into venusaur via level 32"
    },
    {
        "name": "Venusaur",
        "id": 3,
        "types": [
            "grass",
            "poison"
        ],
        "stats": {
            "hp": 80,
            "attack": 82,
            "defense": 83,
            "special-attack": 100,
            "special-defense": 100,
            "speed": 80
        },
        "description": "The plant blooms when it is absorbing solar energy. It stays on the move to seek sunlight.",
        "evolution_info": "bulbasaur evolves into ivysaur via level 16. ivysaur evolves into venusaur via level 32",
        "search_content": "Name: Venusaur. Types: grass, poison. Stats: HP 80, Attack 82. Description: The plant blooms when it is absorbing solar energy. It stays on the move to seek sunlight. Evolution: bulbasaur evolves into ivysaur via level 16. ivysaur evolves into venusaur via level 32"
    }
]